sownlee/MCAL/env/STM32F407VG/header/Header_GPIO.h
#if !defined(HEADER_GPIO_H_) 
#define HEADER_GPIO_H_

#include "Header.h"

typedef struct
{
	__O uint32_t MODER;   /* GPIO port mode register */
	__O uint32_t OTYPER;  /* GPIO port output type register */
	__O uint32_t OSPEEDR; /* GPIO port output speed register */
	__O uint32_t PUPDR;   /* GPIO port pull-up/pull-down register */
	__O uint32_t IDR;     /* GPIO port input data register (GPIOx_IDR) */
	__O uint32_t ODR;     /* GPIO port output data register (GPIOx_ODR) */
	__O uint32_t BSRR;    /* GPIO port bit set/reset register (GPIOx_BSRR) */
	__O uint32_t LCKR;    /* GPIO port configuration lock register (GPIOx_LCKR) */
	__O uint32_t AFR[2];  /* AFR[0] : GPIO alternate function low register, AF[1] : GPIO alternate function high register*/
}GPIO_RegDef_t;

#define GPIOA ((GPIO_RegDef_t *)GPIOA_BASEADDR)
#define GPIOB ((GPIO_RegDef_t *)GPIOB_BASEADDR)
#define GPIOC ((GPIO_RegDef_t *)GPIOC_BASEADDR)
#define GPIOD ((GPIO_RegDef_t *)GPIOD_BASEADDR)
#define GPIOE ((GPIO_RegDef_t *)GPIOE_BASEADDR)
#define GPIOF ((GPIO_RegDef_t *)GPIOF_BASEADDR)
#define GPIOG ((GPIO_RegDef_t *)GPIOG_BASEADDR)
#define GPIOH ((GPIO_RegDef_t *)GPIOH_BASEADDR)
#define GPIOI ((GPIO_RegDef_t *)GPIOI_BASEADDR)

/******************  Bits definition for GPIO_MODER register  *****************/
#define GPIO_MODER_MODER0_Pos            (0U)                                 
#define GPIO_MODER_MODER0_Msk            (0x3UL << GPIO_MODER_MODER0_Pos)      
#define GPIO_MODER_MODER0                GPIO_MODER_MODER0_Msk                
#define GPIO_MODER_MODER0_0              (0x1UL << GPIO_MODER_MODER0_Pos)      
#define GPIO_MODER_MODER0_1              (0x2UL << GPIO_MODER_MODER0_Pos)      
#define GPIO_MODER_MODER1_Pos            (2U)                                 
#define GPIO_MODER_MODER1_Msk            (0x3UL << GPIO_MODER_MODER1_Pos)      
#define GPIO_MODER_MODER1                GPIO_MODER_MODER1_Msk                
#define GPIO_MODER_MODER1_0              (0x1UL << GPIO_MODER_MODER1_Pos)      
#define GPIO_MODER_MODER1_1              (0x2UL << GPIO_MODER_MODER1_Pos)      
#define GPIO_MODER_MODER2_Pos            (4U)                                 
#define GPIO_MODER_MODER2_Msk            (0x3UL << GPIO_MODER_MODER2_Pos)      
#define GPIO_MODER_MODER2                GPIO_MODER_MODER2_Msk                
#define GPIO_MODER_MODER2_0              (0x1UL << GPIO_MODER_MODER2_Pos)      
#define GPIO_MODER_MODER2_1              (0x2UL << GPIO_MODER_MODER2_Pos)      
#define GPIO_MODER_MODER3_Pos            (6U)                                 
#define GPIO_MODER_MODER3_Msk            (0x3UL << GPIO_MODER_MODER3_Pos)      
#define GPIO_MODER_MODER3                GPIO_MODER_MODER3_Msk                
#define GPIO_MODER_MODER3_0              (0x1UL << GPIO_MODER_MODER3_Pos)      
#define GPIO_MODER_MODER3_1              (0x2UL << GPIO_MODER_MODER3_Pos)      
#define GPIO_MODER_MODER4_Pos            (8U)                                 
#define GPIO_MODER_MODER4_Msk            (0x3UL << GPIO_MODER_MODER4_Pos)      
#define GPIO_MODER_MODER4                GPIO_MODER_MODER4_Msk                
#define GPIO_MODER_MODER4_0              (0x1UL << GPIO_MODER_MODER4_Pos)      
#define GPIO_MODER_MODER4_1              (0x2UL << GPIO_MODER_MODER4_Pos)      
#define GPIO_MODER_MODER5_Pos            (10U)                                
#define GPIO_MODER_MODER5_Msk            (0x3UL << GPIO_MODER_MODER5_Pos)      
#define GPIO_MODER_MODER5                GPIO_MODER_MODER5_Msk                
#define GPIO_MODER_MODER5_0              (0x1UL << GPIO_MODER_MODER5_Pos)      
#define GPIO_MODER_MODER5_1              (0x2UL << GPIO_MODER_MODER5_Pos)      
#define GPIO_MODER_MODER6_Pos            (12U)                                
#define GPIO_MODER_MODER6_Msk            (0x3UL << GPIO_MODER_MODER6_Pos)      
#define GPIO_MODER_MODER6                GPIO_MODER_MODER6_Msk                
#define GPIO_MODER_MODER6_0              (0x1UL << GPIO_MODER_MODER6_Pos)      
#define GPIO_MODER_MODER6_1              (0x2UL << GPIO_MODER_MODER6_Pos)      
#define GPIO_MODER_MODER7_Pos            (14U)                                
#define GPIO_MODER_MODER7_Msk            (0x3UL << GPIO_MODER_MODER7_Pos)      
#define GPIO_MODER_MODER7                GPIO_MODER_MODER7_Msk                
#define GPIO_MODER_MODER7_0              (0x1UL << GPIO_MODER_MODER7_Pos)      
#define GPIO_MODER_MODER7_1              (0x2UL << GPIO_MODER_MODER7_Pos)      
#define GPIO_MODER_MODER8_Pos            (16U)                                
#define GPIO_MODER_MODER8_Msk            (0x3UL << GPIO_MODER_MODER8_Pos)      
#define GPIO_MODER_MODER8                GPIO_MODER_MODER8_Msk                
#define GPIO_MODER_MODER8_0              (0x1UL << GPIO_MODER_MODER8_Pos)      
#define GPIO_MODER_MODER8_1              (0x2UL << GPIO_MODER_MODER8_Pos)      
#define GPIO_MODER_MODER9_Pos            (18U)                                
#define GPIO_MODER_MODER9_Msk            (0x3UL << GPIO_MODER_MODER9_Pos)      
#define GPIO_MODER_MODER9                GPIO_MODER_MODER9_Msk                
#define GPIO_MODER_MODER9_0              (0x1UL << GPIO_MODER_MODER9_Pos)      
#define GPIO_MODER_MODER9_1              (0x2UL << GPIO_MODER_MODER9_Pos)      
#define GPIO_MODER_MODER10_Pos           (20U)                                
#define GPIO_MODER_MODER10_Msk           (0x3UL << GPIO_MODER_MODER10_Pos)     
#define GPIO_MODER_MODER10               GPIO_MODER_MODER10_Msk               
#define GPIO_MODER_MODER10_0             (0x1UL << GPIO_MODER_MODER10_Pos)     
#define GPIO_MODER_MODER10_1             (0x2UL << GPIO_MODER_MODER10_Pos)     
#define GPIO_MODER_MODER11_Pos           (22U)                                
#define GPIO_MODER_MODER11_Msk           (0x3UL << GPIO_MODER_MODER11_Pos)     
#define GPIO_MODER_MODER11               GPIO_MODER_MODER11_Msk               
#define GPIO_MODER_MODER11_0             (0x1UL << GPIO_MODER_MODER11_Pos)     
#define GPIO_MODER_MODER11_1             (0x2UL << GPIO_MODER_MODER11_Pos)     
#define GPIO_MODER_MODER12_Pos           (24U)                                
#define GPIO_MODER_MODER12_Msk           (0x3UL << GPIO_MODER_MODER12_Pos)     
#define GPIO_MODER_MODER12               GPIO_MODER_MODER12_Msk               
#define GPIO_MODER_MODER12_0             (0x1UL << GPIO_MODER_MODER12_Pos)     
#define GPIO_MODER_MODER12_1             (0x2UL << GPIO_MODER_MODER12_Pos)     
#define GPIO_MODER_MODER13_Pos           (26U)                                
#define GPIO_MODER_MODER13_Msk           (0x3UL << GPIO_MODER_MODER13_Pos)     
#define GPIO_MODER_MODER13               GPIO_MODER_MODER13_Msk               
#define GPIO_MODER_MODER13_0             (0x1UL << GPIO_MODER_MODER13_Pos)     
#define GPIO_MODER_MODER13_1             (0x2UL << GPIO_MODER_MODER13_Pos)     
#define GPIO_MODER_MODER14_Pos           (28U)                                
#define GPIO_MODER_MODER14_Msk           (0x3UL << GPIO_MODER_MODER14_Pos)     
#define GPIO_MODER_MODER14               GPIO_MODER_MODER14_Msk               
#define GPIO_MODER_MODER14_0             (0x1UL << GPIO_MODER_MODER14_Pos)     
#define GPIO_MODER_MODER14_1             (0x2UL << GPIO_MODER_MODER14_Pos)     
#define GPIO_MODER_MODER15_Pos           (30U)                                
#define GPIO_MODER_MODER15_Msk           (0x3UL << GPIO_MODER_MODER15_Pos)     
#define GPIO_MODER_MODER15               GPIO_MODER_MODER15_Msk               
#define GPIO_MODER_MODER15_0             (0x1UL << GPIO_MODER_MODER15_Pos)     
#define GPIO_MODER_MODER15_1             (0x2UL << GPIO_MODER_MODER15_Pos)     

